pitzDailyOscillatingParabolicInletCase/Allrun
#!/bin/bash


blockMesh
simpleFoam > log.case
